app/controllers/devices_controller.rb

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_device
      @device = Device.find(params[:id])